resume/README.org
#+TITLE: Yeongho Kim

#+OPTIONS: date:nil num:nil

#+LATEX_HEADER: \usepackage{titling}
#+LATEX_HEADER: \setlength{\droptitle}{-20ex}

#+LATEX_HEADER: \usepackage{enumitem}

#+LATEX: \pagenumbering{gobble}
#+LATEX: \vspace{-20ex}

#+ATTR_LATEX: :environment itemize :options [itemindent=20.5em,label=\null,itemsep=-1ex]
- yeonghoey@gmail.com
- yeonghoey.com
- github.com/yeonghoey


* Experience
#+LATEX: \vspace{-4ex}
-----
#+LATEX: \vspace{-4ex}

** _[[https://github.com/what-studio][What! Studio]]_
*** Data and DevOps Engineer | June 2016 – Present
For _[[https://durango.nexon.com/en][Durango: Wild Lands]]_, a seamless open world /MMORPG/,

#+ATTR_LATEX: :environment itemize :options [label=$\circ$,itemsep=-0.5ex]
- Built data pipelines for time series data generated by distributed game servers. Based on
  /Fluentd/, /Amazon Kinesis Streams/, /AWS Lambda/, /Elasticsearch/, /Spark/ and /Zeppelin/.
- Managed infrastructures (>200 instances) across on /AWS/ (>15 services) via /Terraform/.
- Maintained /Couchbase/, the game's main NoSQL Database, to set up, scale up / out,  monitor / tune performance, etc.

** _[[http://frograms.com][FROGRAMS]]_
*** Software Engineer  | Nov 2015 – May 2016
For _[[https://watcha.net/][WATCHA]]_ and _[[https://play.watcha.net][WATCHA PLAY]]_,
a Netflix-like machine-learned movie recommendation and streaming service in Korea

#+ATTR_LATEX: :environment itemize :options [label=$\circ$,itemsep=-0.5ex]
- Established /Scala/ coding standard for the team and introduced /Scala/ code quality tools like
  /scalafmt/, /scalariform/, /Specs2/, /ScalaCheck/, etc.
- Did lots of refactoring on /Scala/ codebase which is based on /Finagle/, high-concurrency RPC framework by /Twitter/.

** _[[http://company.nexon.com/Eng/][NEXON Korea]]_
*** Game Developer  | Dec 2013 – Nov 2015
For _[[http://bf.nexon.com][Bubble Fighter]]_, a casual TPS Game,

#+ATTR_LATEX: :environment itemize :options [label=$\circ$,itemsep=-0.5ex]
- Designed and implemented Intelligent Matchmaking System based on /TrueSkill/ in /C++/.
  Gave a presentation on _[[http://ndcreplay.nexon.com/NDC2015/sessions/NDC2015_0048.html][NDC 2015]]_ (Korean)
- Wrote anti-hacking codes including memory encryption, hash validations for game data, etc.
- Optimized the games's network performance to cope with severe network conditions when doing localization for Indonesia.

* Skills
#+LATEX: \vspace{-4ex}
-----
#+LATEX: \vspace{-4ex}

** Advanced
- ~Python~, ~Bash~, ~Scala~, ~C++~
- ~Linux~, ~AWS~, ~Terraform~, ~Couchbase~,
- ~Apache Spark~, ~Elasticsearch~

** Intermediate
- ~Aurora~, ~MySQL~, ~Docker~, ~Redis~

* Education
#+LATEX: \vspace{-4ex}
-----
#+LATEX: \vspace{-4ex}

** Hanyang University, Seoul | Feb 2006 – Feb 2014
#+ATTR_LATEX: :environment itemize :options [label=$\circ$,itemsep=-0.5ex]
- Double majored: /Philosophy/ and /Computer Science/
- Fulfilled /mandatory national military service/
- Took a leave of absence for building mobile apps
