resume/README.tex
% Created 2017-10-02 Mon 15:49
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{titling}
\setlength{\droptitle}{-20ex}
\usepackage{enumitem}
\date{}
\title{Yeongho Kim}
\hypersetup{
 pdfauthor={Yeongho Kim},
 pdftitle={Yeongho Kim},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.3.1 (Org mode 9.1.1)}, 
 pdflang={English}}
\begin{document}

\maketitle
\pagenumbering{gobble}
\vspace{-20ex}

\begin{itemize}[itemindent=20.5em,label=\null,itemsep=-1ex]
\item yeonghoey@gmail.com
\item yeonghoey.com
\item github.com/yeonghoey
\end{itemize}


\section*{Experience}
\label{sec:org2543ac2}
\vspace{-4ex}

\noindent\rule{\textwidth}{0.5pt}
\vspace{-4ex}

\subsection*{\underline{\href{https://github.com/what-studio}{What! Studio}}}
\label{sec:orgc21e045}
\subsubsection*{Data and DevOps Engineer | June 2016 – Present}
\label{sec:org3c44617}
For \uline{\href{https://durango.nexon.com/en}{Durango: Wild Lands}}, a seamless open world \emph{MMORPG},

\begin{itemize}[label=$\circ$,itemsep=-0.5ex]
\item Built data pipelines for time series data generated by distributed game servers. Based on
\emph{Fluentd}, \emph{Amazon Kinesis Streams}, \emph{AWS Lambda}, \emph{Elasticsearch}, \emph{Spark} and \emph{Zeppelin}.
\item Managed infrastructures (>200 instances) across on \emph{AWS} (>15 services) via \emph{Terraform}.
\item Maintained \emph{Couchbase}, the game's main NoSQL Database, to set up, scale up / out,  monitor / tune performance, etc.
\end{itemize}

\subsection*{\underline{\href{http://frograms.com}{FROGRAMS}}}
\label{sec:orge41f01f}
\subsubsection*{Software Engineer  | Nov 2015 – May 2016}
\label{sec:orgd6a6c2e}
For \uline{\href{https://watcha.net/}{WATCHA}} and \uline{\href{https://play.watcha.net}{WATCHA PLAY}},
a Netflix-like machine-learned movie recommendation and streaming service in Korea

\begin{itemize}[label=$\circ$,itemsep=-0.5ex]
\item Established \emph{Scala} coding standard for the team and introduced \emph{Scala} code quality tools like
\emph{scalafmt}, \emph{scalariform}, \emph{Specs2}, \emph{ScalaCheck}, etc.
\item Did lots of refactoring on \emph{Scala} codebase which is based on \emph{Finagle}, high-concurrency RPC framework by \emph{Twitter}.
\end{itemize}

\subsection*{\underline{\href{http://company.nexon.com/Eng/}{NEXON Korea}}}
\label{sec:org48666f2}
\subsubsection*{Game Developer  | Dec 2013 – Nov 2015}
\label{sec:org42c51fa}
For \uline{\href{http://bf.nexon.com}{Bubble Fighter}}, a casual TPS Game,

\begin{itemize}[label=$\circ$,itemsep=-0.5ex]
\item Designed and implemented Intelligent Matchmaking System based on \emph{TrueSkill} in \emph{C++}.
Gave a presentation on \uline{\href{http://ndcreplay.nexon.com/NDC2015/sessions/NDC2015\_0048.html}{NDC 2015}} (Korean)
\item Wrote anti-hacking codes including memory encryption, hash validations for game data, etc.
\item Optimized the games's network performance to cope with severe network conditions when doing localization for Indonesia.
\end{itemize}

\section*{Skills}
\label{sec:org0424e40}
\vspace{-4ex}

\noindent\rule{\textwidth}{0.5pt}
\vspace{-4ex}

\subsection*{Advanced}
\label{sec:orgef51ce6}
\begin{itemize}
\item \texttt{Python}, \texttt{Bash}, \texttt{Scala}, \texttt{C++}
\item \texttt{Linux}, \texttt{AWS}, \texttt{Terraform}, \texttt{Couchbase},
\item \texttt{Apache Spark}, \texttt{Elasticsearch}
\end{itemize}

\subsection*{Intermediate}
\label{sec:orgbfba2f5}
\begin{itemize}
\item \texttt{Aurora}, \texttt{MySQL}, \texttt{Docker}, \texttt{Redis}
\end{itemize}

\section*{Education}
\label{sec:org62053f9}
\vspace{-4ex}

\noindent\rule{\textwidth}{0.5pt}
\vspace{-4ex}

\subsection*{Hanyang University, Seoul | Feb 2006 – Feb 2014}
\label{sec:org44def7c}
\begin{itemize}[label=$\circ$,itemsep=-0.5ex]
\item Double majored: \emph{Philosophy} and \emph{Computer Science}
\item Fulfilled \emph{mandatory national military service}
\item Took a leave of absence for building mobile apps
\end{itemize}
\end{document}
